desafio/profiler_scripted/artillery-nodebug_script.yaml
config:
  target: "https://localhost:8080"
  tls:
    rejectUnauthorized: false
  phases:
    - name: "Create 50 VUsers"
      duration: 60
      arrivalCount: 50

scenarios:
  - name: "/api/info WithOut Console.log"
    flow:
      - loop:
          - get:
              url: "/api/info"
        count: 20